
"DebugTestKey" = "DebugTestKey en";

/* Global */

"OK" = "OK";
"About…" = "About…";
"Donate…" = "Donate…";
"YES" = "YES";
"NO" = "NO";
"n/a" = "n/a";

"Close" = "Close";
"Cancel" = "Cancel";

/* Help Menu */

"Help_Title" = "Available Keyboard Shortcuts";
"Help_InformativeText" = "N - Next Set
B - Next Brand
O - Poke
R - Reset
SPACE - Pause
S - Screenshot
, - Advance to next effect
D - Show debug information

For more options please go to the preferences menu.";

/* UpdateInfo */

"UpdateInfo_New version <versionString> available at <url>" = "New version %@ available at %@";

/* SkinToneEnum - in Main and Helper App needed */

"Common_Skin Tone" = "Skin Tone";
"SkinToneEnum_Neutral" = "Neutral";
"SkinToneEnum_Type-1-2" = "Type-1-2";
"SkinToneEnum_Type-3" = "Type-3";
"SkinToneEnum_Type-4" = "Type-4";
"SkinToneEnum_Type-5" = "Type-5";
"SkinToneEnum_Type-6" = "Type-6";

/* TimerIntervalEnum */

"TimerIntervalEnum_Never" = "Never";
"TimerIntervalEnum_60 FPS" = "60 FPS";
"TimerIntervalEnum_30 FPS" = "30 FPS";
"TimerIntervalEnum_20 FPS" = "20 FPS";
"TimerIntervalEnum_15 FPS" = "15 FPS";
"TimerIntervalEnum_10 FPS" = "10 FPS";
"TimerIntervalEnum_6 FPS" = "6 FPS";
"TimerIntervalEnum_5 FPS" = "5 FPS";
"TimerIntervalEnum_4 FPS" = "4 FPS";
"TimerIntervalEnum_3 FPS" = "3 FPS";
"TimerIntervalEnum_2 FPS" = "2 FPS";
"TimerIntervalEnum_1 FPS - Every second" = "1 FPS - Every second";
"TimerIntervalEnum_Every second" = "Every second";
"TimerIntervalEnum_Every two seconds" = "Every two seconds";
"TimerIntervalEnum_Every three seconds" = "Every three seconds";
"TimerIntervalEnum_Every five seconds" = "Every five seconds";
"TimerIntervalEnum_Every ten seconds" = "Every ten seconds";
"TimerIntervalEnum_Every twenty seconds" = "Every twenty seconds";
"TimerIntervalEnum_Every thirty seconds" = "Every thirty seconds";
"TimerIntervalEnum_Every minute" = "Every minute";
"TimerIntervalEnum_Every five minutes" = "Every five minutes";
"TimerIntervalEnum_Every ten minutes" = "Every ten minutes";
"TimerIntervalEnum_Every twenty minutes" = "Every twenty minutes";
"TimerIntervalEnum_Every hour" = "Every hour";
"TimerIntervalEnum_Every three hours" = "Every three hours";

/* HaltInterval */

"HaltInterval_Half a second" = "Half a second";
"HaltInterval_One second" = "One second";
"HaltInterval_Two seconds" = "Two seconds";
"HaltInterval_Five seconds" = "Five seconds";
"HaltInterval_Ten seconds" = "Ten seconds";
"HaltInterval_Thirty seconds" = "Thirty seconds";
"HaltInterval_One minute" = "One minute";

/* MovingSpeed */

"MovingSpeed_60 FPS" = "60 FPS";
"MovingSpeed_30 FPS" = "30 FPS";
"MovingSpeed_6 FPS" = "6 FPS";
"MovingSpeed_2 FPS - Half a second" = "2 FPS - Half a second";
"MovingSpeed_One second" = "One second";
"MovingSpeed_Two seconds" = "Two seconds";
"MovingSpeed_Five seconds" = "Five seconds";
"MovingSpeed_Ten seconds" = "Ten seconds";
"MovingSpeed_Thirty seconds" = "Thirty seconds";
"MovingSpeed_One minute" = "One minute";

/* EmojiProgressInterval */

"EmojiProgressInterval_NULL" = "NULL";
"EmojiProgressInterval_MIN" = "MIN";
"EmojiProgressInterval_OFF" = "OFF";

/* DropVelocityStruct */

"DropVelocityStruct_0.1 fields per Second" = "0.1 fields per Second";
"DropVelocityStruct_0.2 fields per Second" = "0.2 fields per Second";
"DropVelocityStruct_0.5 fields per Second" = "0.5 fields per Second";
"DropVelocityStruct_1 field per Second" = "1 field per Second";
"DropVelocityStruct_10 fields per Second" = "10 fields per Second";
"DropVelocityStruct_12 fields per Second" = "12 fields per Second";
"DropVelocityStruct_15 fields per Second" = "15 fields per Second";
"DropVelocityStruct_2 fields per Second" = "2 fields per Second";
"DropVelocityStruct_20 fields per Second" = "20 fields per Second";
"DropVelocityStruct_30 fields per Second" = "30 fields per Second";
"DropVelocityStruct_4 fields per Second" = "4 fields per Second";
"DropVelocityStruct_5 fields per Second" = "5 fields per Second";
"DropVelocityStruct_6 fields per Second" = "6 fields per Second";
"DropVelocityStruct_60 fields per Second" = "60 fields per Second";
"DropVelocityStruct_The unhasty snake" = "The unhasty snake";

/* AllEmojisParade_Thinning */

"AllEmojisParade_Thinning_none" = "None";
"AllEmojisParade_Thinning_regular2" = "Regular 2";
"AllEmojisParade_Thinning_regular5" = "Regular 5";
"AllEmojisParade_Thinning_regular10" = "Regular 10";
"AllEmojisParade_Thinning_thin" = "Thin";
"AllEmojisParade_Thinning_thick" = "Thick";

/* AllEmojisParade_BandKind */

"AllEmojisParade_BandKind_snake" = "Snake";
"AllEmojisParade_BandKind_snakeVertical" = "Snake Vertical";
"AllEmojisParade_BandKind_spiral" = "Spiral";
"AllEmojisParade_BandKind_spiralCounterClockwise" = "Spiral Counter Clockwise";

/* Speckle_SizeDistributionStruct */

"Speckle_SizeDistributionStruct_OnlyTiny" = "Only tiny";
"Speckle_SizeDistributionStruct_OnlyRegular" = "Only regular";
"Speckle_SizeDistributionStruct_OnlyLarge" = "Only large";
"Speckle_SizeDistributionStruct_OnlyExtraLarge" = "Only extra large";
"Speckle_SizeDistributionStruct_ManySmall,SomeRegular" = "Many small, some regular";
"Speckle_SizeDistributionStruct_ManyRegular,FewLarge" = "Many regular, few large";
"Speckle_SizeDistributionStruct_Small,Medium,Large,XtraLarge" = "Small, medium, large, extra large";

/* Sinus_ScaleFactorType struct */

"Sinus_ScaleFactorType_constant" = "Constant";
"Sinus_ScaleFactorType_sinus" = "Sine";
"Sinus_ScaleFactorType_bigSmall" = "Big / Small";
"Sinus_ScaleFactorType_random" = "Random";

/* Menu */

"Menu_Actions_Title" = "Actions";
"Menu_Actions_Pause" = "Pause";
"Menu_Actions_Continue" = "Continue";
"Menu_Actions_Reset" = "Reset";

"Menu_Actions_Poke" = "Poke";
"Menu_Actions_NextBag" = "Advance to Next Set";
"Menu_Actions_NextBrand" = "Advance to Next Brand";
"Menu_Actions_RenderingData" = "Rendering Data";

"Menu_Actions_Digit1" = "Special 1";
"Menu_Actions_Digit2" = "Special 2";
"Menu_Actions_Digit3" = "Special 3";
"Menu_Actions_Digit4" = "Special 4";
"Menu_Actions_Digit5" = "Special 5";
"Menu_Actions_Digit6" = "Special 6";
"Menu_Actions_Digit7" = "Special 7";
"Menu_Actions_Digit8" = "Special 8";
"Menu_Actions_Digit9" = "Special 9";
"Menu_Actions_Digit0" = "Special 0";

"Menu_Actions_Screenshot" = "Screenshot";
"Menu_Actions_Download" = "Download Screen Saver";

/* SetupProgress */

"SetupProgress_Preparing <BrandName>…" = "Preparing %@…";
"SetupProgress_<AppName> Setup" = "%@ Setup";

/* Faq Window */

"FaqWindow_<AppName> FAQ" = "%@ FAQ";

/* About Window */

"AboutWindow_About <AppName>" = "About %@";

/* Screen Saver */

"SaverName_BucketParty" = "Bucket Party";
"SaverName_PatternsInTheRain" = "Patterns In The Rain";
"SaverName_Drama" = "Drama Performance";
"SaverName_SlowFlip" = "Slow Flip";
"SaverName_Speckle" = "Speckle";
"SaverName_Words" = "Words";
"SaverName_UnicodeSubcategories" = "Unicode Categories";
"SaverName_Alphabet" = "Alphabet";
"SaverName_Random" = "🔄 Random Saver";
"SaverName_FlyingCubes" = "Flying Cubes";
"SaverName_DuckZoomer" = "Zoomer";
"SaverName_DuckDrops" = "Drops";
"SaverName_DuckSinus" = "Sinus";
"SaverName_DuckStarfield" = "Starfield";
"SaverName_DuckRollingmojis" = "Rollingmojis";
"SaverName_GooseVerySimple" = "All Emojis Very Simple [NEW]";
"SaverName_GooseAllEmojisParade" = "💥 All-Emojis-Parade [NEW]";
"SaverName_EmojiSaverCommercial" = "Emoji Saver Commercial";

/* SaverSettings */

"SaverSettings_Please close and reopen System Preferences." = "Please close and reopen System Preferences.";
"SaverSettings_Your computer does not support Metal." = "Your computer does not support Metal ⚓🤖. Download the legacy version.";
"SaverSettings_Available in standard edition" = "Available in standard edition";

"SaverSettings_Global_randomSaverCodes" = "Screen Savers";
"SaverSettings_Global_effectChangeInterval" = "Change";
"SaverSettings_Global_multipleDisplayMode" = "Multiple Displays Mode";
"MultipleDisplayMode_MainOnly" = "Use only main";
"MultipleDisplayMode_AllSame" = "All with same effect";
"MultipleDisplayMode_AllDifferent" = "All with different effects";

"SaverSettings_Global_brandName" = "Brand";
"SaverSettings_Global_emojiHeidth" = "Emoji Size";
"SaverSettings_Global_font" = "Font";
"SaverSettings_Global_emojiBags" = "Emoji Sets";
"SaverSettings_Global_emojiBagsThickness" = "Emoji Sets Thickness";
"SaverSettings_Global_emojiActors" = "Emoji Actors";
"SaverSettings_Global_timerIntervalInTicks" = "Speed";
"SaverSettings_Global_setProgressInterval" = "Next Set Interval";
"SaverSettings_Global_presentationHaltTuration" = "Halt Duration";
"SaverSettings_Global_emojiProgressInterval" = "Next Emoji Interval";
"SaverSettings_Global_movingSpeed" = "Speed";

"SaverSettings_Random_brands" = "Brands";

"SaverSettings_Alphabet_groupsInAToZOrder" = "Ordered A-Z";
"SaverSettings_Alphabet_drawPerVuelta" = "Emojis per Frame";
"SaverSettings_Alphabet_mode" = "Mode";
"SaverSettings_Alphabet_modeSprinkleMultiplier" = "Sprinkle Multiplier";

"SaverSettings_BucketParty_addInterval" = "Adding Interval";
"SaverSettings_BucketParty_rainStyle" = "Rain Style";
"SaverSettings_BucketParty_rainSlotCount" = "Rain Slots";
"SaverSettings_BucketParty_platformConfiguration" = "Platform Configuration";
"SaverSettings_BucketParty_evictionCount" = "Eviction Count";
"SaverSettings_BucketParty_allowRotation" = "Allow Rotation";
"SaverSettings_BucketParty_moonGravity" = "Moon Gravity";

"BucketParty_RainStyle_leftToRight" = "Left to right";
"BucketParty_RainStyle_rightToLeft" = "Right to left";
"BucketParty_RainStyle_kitt" = "K.I.T.T.";
"BucketParty_RainStyle_anywhere" = "Random Position";
"BucketParty_RainStyle_random" = "Random";

"BucketParty_PlatformConfiguration_bucket" = "Bucket";
"BucketParty_PlatformConfiguration_platform" = "Ground";
"BucketParty_PlatformConfiguration_layeredPlatforms" = "Two Platforms";
"BucketParty_PlatformConfiguration_random" = "Random";

"SaverSettings_Drama_maximumSimultaneously" = "Maximum Simultaneously";
"SaverSettings_Drama_synchronous" = "Synchronous";
"SaverSettings_Drama_addRate" = "Add Rate";

"SaverSettings_DuckDrops_totalDropCount" = "Total Drops";
"SaverSettings_DuckDrops_circleOrRect" = "Circular";
"SaverSettings_DuckDrops_animateOnWater" = "Splash animated";
"SaverSettings_DuckDrops_waterDuckCount" = "Splash Emojis";
"SaverSettings_DuckDrops_splashSizeFactor" = "Splash Size";
"SaverSettings_DuckDrops_splashDuration" = "Splash Duration";

"SaverSettings_DuckRollingmojis_rowCount" = "Rows";
"SaverSettings_DuckRollingmojis_phased" = "Phased";
"SaverSettings_DuckRollingmojis_heidthFactor" = "Size";
"SaverSettings_DuckRollingmojis_rollDuration" = "Roll Duration";
"SaverSettings_DuckRollingmojis_haltDuration" = "Halt Duration";

"SaverSettings_DuckSinus_addInterval" = "Add Interval";
"SaverSettings_DuckSinus_addCount" = "Add Count";
"SaverSettings_DuckSinus_totalDuration" = "Duration";
"SaverSettings_DuckSinus_electronCount" = "Electron Count";
"SaverSettings_DuckSinus_heidthFactorRange" = "Size";
"SaverSettings_DuckSinus_ellipseRadiusRange" = "Radius";
"SaverSettings_DuckSinus_scaleFactorType" = "Type";
"SaverSettings_DuckSinus_speedX" = "Speed X";
"SaverSettings_DuckSinus_speedY" = "Speed Y";

"SaverSettings_DuckStarfield_pulsar" = "Pulsar";
"SaverSettings_DuckStarfield_totalStarCount" = "Star Count";
"SaverSettings_DuckStarfield_starDuration" = "Duration";
"SaverSettings_DuckStarfield_starSizeFactor" = "Size";
"SaverSettings_DuckStarfield_rotationsPerMinute" = "Rotation";

"SaverSettings_DuckZoomer_zoomDuration" = "Duration";
"SaverSettings_DuckZoomer_rotationRange" = "Rotation";
"SaverSettings_DuckZoomer_destHeidthRange" = "Size";

"SaverSettings_FlyingCubes_cubeHeidthFactor" = "Size";
"SaverSettings_FlyingCubes_cubesDistance" = "Distance";
"SaverSettings_FlyingCubes_rotationRateXYZ" = "Rotation Rate XYZ";
"SaverSettings_FlyingCubes_rotationPhased" = "Phased";
"SaverSettings_FlyingCubes_rotationRandomizedInitial" = "Initially Randomized";
"SaverSettings_FlyingCubes_orthogonal" = "Orthogonal";
"SaverSettings_FlyingCubes_colored" = "Grayish Background";
"SaverSettings_FlyingCubes_windFactor" = "Wind XY";
"SaverSettings_FlyingCubes_sinusFactor" = "Sine Wave XY";
"SaverSettings_FlyingCubes_sinusDuration" = "Sine Wave Duration XY";
"SaverSettings_FlyingCubes_fillPercentage" = "Fill Percentage";

"SaverSettings_GooseAllEmojisParade_thinning" = "Thinning";
"SaverSettings_GooseAllEmojisParade_animateSkinTones" = "Skin Tone Animation";
"SaverSettings_GooseAllEmojisParade_bandKind" = "Layout";

"SaverSettings_GooseVerySimple_count" = "Count";
"SaverSettings_GooseVerySimple_spacing" = "Spacing";
"SaverSettings_GooseVerySimple_random" = "Random";

"SaverSettings_PatternsInTheRain_rain" = "Rain";
"SaverSettings_PatternsInTheRain_iterator_checkered" = "Checkered Pattern";
"SaverSettings_PatternsInTheRain_iterator_ordered" = "Ordered Pattern";
"SaverSettings_PatternsInTheRain_iterator_spiral" = "Spiral Pattern";
"SaverSettings_PatternsInTheRain_iterator_randomOuterLine" = "Random Outer Line Pattern";
"SaverSettings_PatternsInTheRain_iterator_random" = "Random Pattern";
"SaverSettings_PatternsInTheRain_patterns" = "Patterns";
"SaverSettings_PatternsInTheRain_patterns_emojisPerSecond" = "Patterns - Emojis Per Second";
"SaverSettings_PatternsInTheRain_rain_addProbability" = "Rain - Add Probability";
"SaverSettings_PatternsInTheRain_rain_maxSimultaneousAdds" = "Rain - Max Simultaneous Adds";
"SaverSettings_PatternsInTheRain_rain_maxRunningDrops" = "Rain - Max Running Drops";
"SaverSettings_PatternsInTheRain_rain_synchronous" = "Rain - Synchronous";
"SaverSettings_PatternsInTheRain_rain_dropVelocities" = "Rain - Drop Velocities";

"SaverSettings_SlowFlip_flipCount" = "Flip Count";
"SaverSettings_SlowFlip_canFlipBack" = "Can Flip Back";

"SaverSettings_Speckle_eps" = "Emojis Per Second";
"SaverSettings_Speckle_size" = "Emoji Sizes";
"SaverSettings_Speckle_overscanScale" = "Overscan";
"SaverSettings_Speckle_sceneDuration" = "Scene Duration";
"SaverSettings_Speckle_pauseDuration" = "Pause Duration";
"SaverSettings_Speckle_rotationDegrees" = "Rotation Degree";

"SaverSettings_Words_words" = "Words";
"SaverSettings_Words_randomize" = "Randomize";
"SaverSettings_Words_minimumWidth" = "Minimum Width";

"SaverSettings_UnicodeSubcategories_groupsInAToZOrder" = "Order A-Z";
"SaverSettings_UnicodeSubcategories_drawPerVuelta" = "Emojis per Frame";
"SaverSettings_UnicodeSubcategories_mode" = "Mode";
"SaverSettings_UnicodeSubcategories_mode_Blocks" = "Blocks";
"SaverSettings_UnicodeSubcategories_mode_Blocks (shuffled)" = "Blocks (shuffled)";
"SaverSettings_UnicodeSubcategories_mode_Sprinkle" = "Sprinkle";
"SaverSettings_UnicodeSubcategories_modeSprinkleMultiplier" = "Sprinkle - Multiplier";

/* Dramas */

"Drama_animalrow" = "Animal Row";
"Drama_biceps" = "Biceps";
"Drama_bomb" = "Bomb";
"Drama_cats" = "Cats";
"Drama_clocks" = "Clocks";
"Drama_earth" = "Earth";
"Drama_falling_stars" = "Falling Stars";
"Drama_flags" = "Flags";
"Drama_grrrr" = "Grrr";
"Drama_happy" = "Happy";
"Drama_hearts" = "Hearts";
"Drama_hearts_moving" = "Hearts moving";
"Drama_hearts_of_ecstasy" = "Hearts of Ecstasy";
"Drama_left_runner" = "Runner";
"Drama_magic" = "Magic";
"Drama_mailbox" = "Mailbox";
"Drama_moon_phases" = "Moon";
"Drama_pictures" = "Pictures";
"Drama_professions_female" = "Professions f";
"Drama_professions_male" = "Professions m";
"Drama_professions_person" = "Professions n";
"Drama_right_snail" = "Snail";
"Drama_roaming" = "Roaming ↻";
"Drama_roaming_counterclockwise" = "Roaming ↺";
"Drama_savanna" = "Savanna";
"Drama_snake" = "Snake";
"Drama_speaker" = "Speaker";
"Drama_splash" = "Splash";
"Drama_spock" = "Spock";
"Drama_suits" = "Suits";
"Drama_swimmer" = "Swimmer";
"Drama_three_monkeys" = "Three Monkeys";
"Drama_thunder" = "Thunder";

/* Bags */

"Bag_activities" = "Activities";
"Bag_animals" = "Animals";
"Bag_animalstaring" = "Animals Staring";
"Bag_bodyparts" = "Body parts";
"Bag_buildings" = "Buildings";
"Bag_candy" = "Candy";
"Bag_cats" = "Cats";
"Bag_christmas" = "Christmas";
"Bag_clock_faces" = "Clock Faces";
"Bag_clothes" = "Clothes and accessorizes";
"Bag_colored_black" = "Colored Black";
"Bag_colored_blue" = "Colored Blue";
"Bag_colored_cyan" = "Colored Cyan";
"Bag_colored_green" = "Colored Green";
"Bag_colored_orange" = "Colored Orange";
"Bag_colored_pink" = "Colored Pink";
"Bag_colored_purple" = "Colored Purple";
"Bag_colored_red" = "Colored Red";
"Bag_colored_white" = "Colored White";
"Bag_colored_yellow" = "Colored Yellow";
"Bag_detailrich" = "Rich in Detail";
"Bag_drinks" = "Drinks";
"Bag_evil" = "Evil";
"Bag_family" = "Family";
"Bag_fantasy" = "Fantasy";
"Bag_flags" = "Flags (all)";
"Bag_flags_africa" = "Flags Africa";
"Bag_flags_asia" = "Flags Asia";
"Bag_flags_atlantic_ocean" = "Flags Atlantic Ocean";
"Bag_flags_australia" = "Flags Australia";
"Bag_flags_caribbean" = "Flags Caribbean";
"Bag_flags_central_america" = "Flags Central America";
"Bag_flags_europe" = "Flags Europe";
"Bag_flags_indian_ocean" = "Flags Indian Ocean";
"Bag_flags_middle_east" = "Flags Middle East";
"Bag_flags_north_america" = "Flags North America";
"Bag_flags_other" = "Flags (other)";
"Bag_flags_pacific_ocean" = "Flags Pacific Ocean";
"Bag_flags_south_america" = "Flags South America";
"Bag_food" = "Food";
"Bag_forbidden" = "Forbidden";
"Bag_fruit" = "Fruits";
"Bag_games" = "Games";
"Bag_geographic" = "Geographic";
"Bag_gestures" = "Gestures";
"Bag_halloween" = "Halloween";
"Bag_hands" = "Hands";
"Bag_hearts" = "Hearts";
"Bag_keycaps" = "Keycaps";
"Bag_leftovers" = "Leftovers";
"Bag_media" = "Computers and media";
"Bag_monkeys" = "Monkeys";
"Bag_moons" = "Moons";
"Bag_music" = "Music";
"Bag_nature" = "Nature";
"Bag_office" = "Office and work";
"Bag_paint" = "Paint";
"Bag_party" = "Party";
"Bag_people" = "People";
"Bag_persons" = "Persons";
"Bag_pictures" = "Pictures";
"Bag_plants" = "Plants";
"Bag_poo" = "Poo";
"Bag_portraits" = "Portraits";
"Bag_professions_female" = "Female Professions";
"Bag_professions_male" = "Male Professions";
"Bag_professions_person" = "Professions (neutral)";
"Bag_rainbow" = "Rainbow";
"Bag_seethrough" = "See-through";
"Bag_selectionearly2017" = "Selection Early 2017";
"Bag_signature" = "Signature selection";
"Bag_smileys" = "Smileys";
"Bag_smileys_happy" = "Happy Smileys";
"Bag_smileys_selection" = "Smiley selection";
"Bag_sports" = "Sports";
"Bag_squared" = "Squared";
"Bag_squared_all" = "Squared (all)";
"Bag_stars" = "Stars";
"Bag_time" = "Time";
"Bag_tools" = "Tools";
"Bag_transportation" = "Transportation";
"Bag_vacation" = "Vacation and travel";
"Bag_weather" = "Weather";
"Bag_wedding" = "Wedding";
"Bag_year2017" = "Year 2017";
"Bag_year2018" = "2018 (macOS 10.14.1)";
"Bag_year2019" = "2019 (macOS 10.15.2)";
"Bag_year2020" = "2020 (macOS 11.4)";
"Bag_year2021" = "2021 (macOS 12.3)";
"Bag_year2023" = "(NEW) 2023 (macOS 13.3)";
"Bag_zodiac_signs" = "Zodiac signs";
